app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("firstname", "secondname", "reg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "NAKIRUTIMANA"], ["secondname", "THEONEST"], ["reg", 217123222], ["created_at", "2019-01-31 16:45:00.032645"], ["updated_at", "2019-01-31 16:45:00.032645"]]